pg_bench/postgresql_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 prepare >> postgresql_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest3'...
Creating table 'sbtest2'...
Creating table 'sbtest6'...
Creating table 'sbtest1'...
Creating table 'sbtest4'...
Creating table 'sbtest8'...
Creating table 'sbtest5'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest6'
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest5'
Inserting 1000000 records into 'sbtest7'
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest5'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest3'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 run >> postgresql_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 3383.31 qps: 20303.75 (r/w/o: 0.00/13535.84/6767.92) lat (ms,95%): 4.03 err/s: 0.20 reconn/s: 0.00
[ 20s ] thds: 8 tps: 4163.00 qps: 24979.28 (r/w/o: 0.00/16652.79/8326.49) lat (ms,95%): 2.66 err/s: 0.10 reconn/s: 0.00
[ 30s ] thds: 8 tps: 4157.25 qps: 24942.88 (r/w/o: 0.00/16628.19/8314.69) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 3732.58 qps: 22395.16 (r/w/o: 0.00/14929.51/7465.65) lat (ms,95%): 2.97 err/s: 0.10 reconn/s: 0.00
[ 50s ] thds: 8 tps: 4207.79 qps: 25246.74 (r/w/o: 0.00/16830.76/8415.98) lat (ms,95%): 2.61 err/s: 0.10 reconn/s: 0.00
[ 60s ] thds: 8 tps: 2703.24 qps: 16221.54 (r/w/o: 0.00/10814.56/5406.98) lat (ms,95%): 4.41 err/s: 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           893938
        other:                           446996
        total:                           1340934
    transactions:                        223485 (3720.80 per sec.)
    queries:                             1340934 (22325.22 per sec.)
    ignored errors:                      6      (0.10 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0624s
    total number of events:              223485

Latency (ms):
         min:                                    0.51
         avg:                                    2.15
         max:                                  162.47
         95th percentile:                        3.25
         sum:                               479751.19

Threads fairness:
    events (avg/stddev):           27935.6250/41.17
    execution time (avg/stddev):   59.9689/0.01

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 cleanup>> postgresql_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...