pg_bench/postgresql_select_random_points_threads_8_time_60_tables_20_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql select_random_points --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=20 --table-size=1000000 prepare >> postgresql_select_random_points_threads_8_time_60_tables_20_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest3'...
Creating table 'sbtest5'...
Creating table 'sbtest7'...
Creating table 'sbtest4'...
Creating table 'sbtest2'...
Creating table 'sbtest1'...
Creating table 'sbtest6'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest7'
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest5'
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest6'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest5'...
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest11'...
Inserting 1000000 records into 'sbtest11'
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating table 'sbtest13'...
Inserting 1000000 records into 'sbtest13'
Creating table 'sbtest16'...
Inserting 1000000 records into 'sbtest16'
Creating table 'sbtest9'...
Creating table 'sbtest14'...
Inserting 1000000 records into 'sbtest9'
Inserting 1000000 records into 'sbtest14'
Creating table 'sbtest15'...
Inserting 1000000 records into 'sbtest15'
Creating table 'sbtest12'...
Inserting 1000000 records into 'sbtest12'
Creating a secondary index on 'sbtest11'...
Creating a secondary index on 'sbtest10'...
Creating a secondary index on 'sbtest16'...
Creating a secondary index on 'sbtest14'...
Creating a secondary index on 'sbtest9'...
Creating a secondary index on 'sbtest15'...
Creating a secondary index on 'sbtest13'...
Creating a secondary index on 'sbtest12'...
Creating table 'sbtest19'...
Inserting 1000000 records into 'sbtest19'
Creating table 'sbtest18'...
Inserting 1000000 records into 'sbtest18'
Creating table 'sbtest17'...
Inserting 1000000 records into 'sbtest17'
Creating table 'sbtest20'...
Inserting 1000000 records into 'sbtest20'
Creating a secondary index on 'sbtest19'...
Creating a secondary index on 'sbtest17'...
Creating a secondary index on 'sbtest18'...
Creating a secondary index on 'sbtest20'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql select_random_points --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=20 --table-size=1000000 run >> postgresql_select_random_points_threads_8_time_60_tables_20_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 103228.34 qps: 103228.34 (r/w/o: 103228.34/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 106264.93 qps: 106264.93 (r/w/o: 106264.93/0.00/0.00) lat (ms,95%): 0.14 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 113857.27 qps: 113857.27 (r/w/o: 113857.27/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 115608.46 qps: 115608.46 (r/w/o: 115608.46/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 111945.41 qps: 111945.51 (r/w/o: 111945.51/0.00/0.00) lat (ms,95%): 0.14 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 119785.79 qps: 119785.69 (r/w/o: 119785.69/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6708247
        write:                           0
        other:                           0
        total:                           6708247
    transactions:                        6708247 (111767.96 per sec.)
    queries:                             6708247 (111767.96 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0188s
    total number of events:              6708247

Latency (ms):
         min:                                    0.03
         avg:                                    0.07
         max:                                   70.16
         95th percentile:                        0.14
         sum:                               475165.37

Threads fairness:
    events (avg/stddev):           838530.8750/153314.23
    execution time (avg/stddev):   59.3957/0.09

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=20 --table-size=1000000 cleanup>> postgresql_select_random_points_threads_8_time_60_tables_20_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
Dropping table 'sbtest11'...
Dropping table 'sbtest12'...
Dropping table 'sbtest13'...
Dropping table 'sbtest14'...
Dropping table 'sbtest15'...
Dropping table 'sbtest16'...
Dropping table 'sbtest17'...
Dropping table 'sbtest18'...
Dropping table 'sbtest19'...
Dropping table 'sbtest20'...