pg_bench/postgresql_select_random_points_threads_8_time_60_tables_2_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql select_random_points --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> postgresql_select_random_points_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest2'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql select_random_points --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> postgresql_select_random_points_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 124981.04 qps: 124981.04 (r/w/o: 124981.04/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 133572.76 qps: 133572.76 (r/w/o: 133572.76/0.00/0.00) lat (ms,95%): 0.12 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 130174.30 qps: 130174.40 (r/w/o: 130174.40/0.00/0.00) lat (ms,95%): 0.12 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 131326.12 qps: 131326.12 (r/w/o: 131326.12/0.00/0.00) lat (ms,95%): 0.12 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 122955.78 qps: 122955.68 (r/w/o: 122955.68/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 123998.26 qps: 123998.26 (r/w/o: 123998.26/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7670349
        write:                           0
        other:                           0
        total:                           7670349
    transactions:                        7670349 (127808.10 per sec.)
    queries:                             7670349 (127808.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0130s
    total number of events:              7670349

Latency (ms):
         min:                                    0.03
         avg:                                    0.06
         max:                                   77.30
         95th percentile:                        0.12
         sum:                               475157.96

Threads fairness:
    events (avg/stddev):           958793.6250/145621.24
    execution time (avg/stddev):   59.3947/0.07

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup>> postgresql_select_random_points_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...